cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/versions'
brew 'mas'

# neovim
tap 'neovim/homebrew-neovim'
tap 'universal-ctags/universal-ctags'
brew 'neovim'
brew 'universal-ctags'

# cask
cask 'google-chrome'
cask 'iterm2'
cask 'hammerspoon'
cask 'slack'
cask 'smoothmouse' # not giving up on you yet ;_;
cask 'sourcetree'
cask 'vagrant'
cask 'virtualbox'
cask 'steam'
cask 'spotify'
cask 'vlc'

# app store
mas 'Pixelmator', id: 407963104
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835

# brew
brew 'elixir'
brew 'fzf'
brew 'imagemagick'
brew 'rbenv'
brew 'nodenv'
brew 'pstree'
brew 'reattach-to-user-namespace'
brew 'tig'
brew 'tmux'
brew 'zsh'

# services
brew 'elasticsearch', restart_service: :changed, start_service: true
brew 'postgresql', restart_service: :changed, start_service: true
brew 'dnsmasq', restart_service: :changed, start_service: true
brew 'rabbitmq', restart_service: :changed, start_service: true
brew 'nginx', restart_service: :changed, start_service: true
